<?php get_header(); ?>

<div class="titleline1"><p>Продукты и описание</p></div>
<div id="content" class="grid_12 alpha omega" xmlns="http://www.w3.org/1999/html">
    <div class="clear"></div>
    <!--Описание дистра-->
    <div class="grid_4 about">
        <div class="info">
            <b>Mageia</b> - это стабильная и безопасная, свободная операционная система для персональных компьютеров
            и
            серверов, основанная на GNU/Linux.
        </div>
        <div class="detail">
            Тысячи людей и десятки организаций по всему миру выбирают Mageia для повседневного использования дома и
            в офисе.
        </div>
		<div class="button"><a href="/download">Загрузите прямо сейчас</a></div>
        
    </div>
    
	<div id="slider" class="slider_wrap">	
		<img src="<?php echo get_template_directory_uri(); ?>/images/pages/main/slide/kde.png" alt="kde"/>
		<img src="<?php echo get_template_directory_uri(); ?>/images/pages/main/slide/mate.png" alt="mate"/>
		<img src="<?php echo get_template_directory_uri(); ?>/images/pages/main/slide/lxde.png" alt="lxde"/>
		<img src="<?php echo get_template_directory_uri(); ?>/images/pages/main/slide/e17.png" alt="e17"/>		
	</div>
</div>
<div class="clear"></div>
<div class="garmblock">
    <div class="garm">
        <div class="garmpic1"></div>
        <div class="garmhead">
            Mageia - это социальное программное обеспечение
        </div>
    </div>
    <div class="garmcontent">
        <ul>
            <li>Мы, как сообщество, всегда ценим наших пользователей. Мы всегда находимся в 
			тесном контакте с нашим кругом пользователей, поскольку пользователи являются 
			неотъемлемой частью сообщества как и его создатели, и организаторы.</li>
            <li>Мы понимаем, что самым ценным нашим капиталом являются люди и общество.</li>
            <li>Мы всегда будем дистрибутивом сообщества и будем ценить взносы сообщества.</li>
            <li>Мы всегда будем открытым дистрибутивом, мы прислушиваемся к каждому из участников сообщества.</li>
            <li>Мы очень ценим дружбу и поддерживаем социальное взаимодействие между людьми.</li>
            <li>Мы ценим целостность, сообщество, доверие и всегда придерживаемся высоких этических стандартов.</li>
            <li>Мы любим свое дело и получаем удовольствие от нашей работы.</li>
            <li>Мы постараемся поддерживать добровольность всех действий, как с нашей стороны, так 
			и со стороны широкой общественности открытого программного обеспечения.</li>
            <li>Мы будем помогать друг другу и поддерживать друг друга. Если будут возникать проблемы, 
			мы будем принимать соответствующие шаги для поиска наилучшего решения и воспользуемся им.</li>
        </ul>
    </div>
    <div class="garm">
        <div class="garmpic"></div>
        <div class="garmhead">Mageia - это мощная технология</div>
    </div>
    <div class="garmcontent">
        <ul>
            <li>Мы, как проект свободного программного обеспечения, операционная система, постоянно 
			внедряем инновации, чтобы оставаться на переднем рубеже вычислительных технологий.</li>
            <li>Мы будем придерживаться современных тенденций в свободном программном обеспечении, 
			хотя будем сохранять разумный баланс между модернизацией и надежностью работы наших релизов.</li>
            <li>Мы будем поддерживать тесную связь внутри нашего сообщества, нашей целью будет мост в совместной разработке.</li>
            <li>Мы будем рады, если наши пользователи получат максимальный эффект от использования компьютеров.</li>
            <li>Мы будем бороться за простоту в использовании, но будем предоставлять сбалансированный 
			набор инновационных технологий для новых и опытных пользователей.</li>
        </ul>
    </div>
    <div class="garm">
        <div class="garmpictech"></div>
        <div class="garmhead">
            Mageia - это знание
        </div>
    </div>
    <div class="garmcontent">
        <ul>
			<li>Программное обеспечение является неотъемлемой частью нашей повседневной жизни, почти любой его сферы, дома и во всем мире, а сердцем программного обеспечения является программный код. Мы будем изучать принципы работы программного обеспечения при его работе в повседневной жизни.</li>
            <li>Мы предоставим нашим пользователям мощные средства управления современными технологиями.</li>
            <li>Мы отмечаем человеческую природу. Случаются ошибки, а контекст событий может меняться. Мы будем учитывать это в нашем программном обеспечении и в жизни. Мы развиваемся.</li>
            <li>Мы верим в то, что нет ничего лучше понимания программного обеспечения, которым мы пользуемся в повседневной жизни. Поэтому мы будем обучать людей пользованию свободным программным обеспечением, участию в сообществе и пользованию нашей операционной системой.</li>
        </ul>
    </div>
    <div class="garm">
        <div class="garmpicquality"></div>
        <div class="garmhead">
            Mageia - это качество
        </div>
    </div>
    <div class="garmcontent">
        <ul>
			<li>Mageia будет основана на требованиях относительно надлежащего качества и стабильности.</li>
            <li>Mageia будет оставаться совместимой со стандартами свободного программного обеспечения.</li>
            <li>Mageia всегда будет придерживаться самых высоких стандартов защиты и конфиденциальности и 
			использовать современные технологии для защиты данных наших пользователей.</li>
        </ul>
    </div>
    <div class="garm">
        <div class="garmpicsocial"></div>
        <div class="garmhead">
            Mageia - это открытость отношений
        </div>
    </div>
    <div class="garmcontent">
        <ul>
            <li>Все вопросы будущего дистрибутива будут решаться сообществом.</li>
            <li>Мы будем сотрудничать с другими дистрибутивами свободного программного обеспечения, разработчиками ядра и основ системы и посылать им наш код.</li>
            <li>Вы будете сотрудничать с другими проектами по развитию открытого программного обеспечения.</li>
            <li>Мы будем рады участию в нашем сообществе любых коммерческих компаний.</li>
            <li>Mageia основана на свободном программном обеспечении. Впрочем, если захотите, вы можете использовать и закрытое ПО, потому что мы учитываем потребности и пожелания наших пользователей</li>
            <li>Mageia будет коллективным международным и упорядоченным проектом, будет отвечать плюралистичности нашего сообщества.</li>
        </ul>
    </div>
</div>
<div class="newscontainer">
    <div class="newshead">Последние новости</div>
    <div id="newsblock" class="grid_12">


        <div id="leftarrow" class="button"> &lt; </div>
        <div id="rightarrow" class="button"> &gt; </div>
        <?php if (have_posts()) :
            $i = 0;
            while (have_posts()) : the_post(); ?>
                <div class="grid_3 news">
                    <div class="newsdetails">
                        <br><?php the_time('F jS, Y'); ?>
                    </div>
                        <H4>
						<a href="<?php the_permalink(); ?>">
                            <?php
                            trimAndPrint(get_the_title(), 30, "...");
                            ?>
						</a>
                        </H4>
                    <p>
                        <?php
                        trimAndPrint(get_the_content(), 120, "...");
                        ?>
                    </p>
                </div>
                <?php if (++$i >= 6) break;
            endwhile;
        endif; ?>
    </div>
</div>
<div class="clear"></div>

<?php get_footer(); ?>


<?php
/**
 * Обрезает текст, если он больше указанной длинны $len
 * и добавляет в конец указанную строку $endstr
 */
function trimAndPrint($string, $len, $endstr)
{
    if (iconv_strlen($string, "utf-8") > $len)
        print(mb_substr(strip_tags($string), 0, $len) . $endstr);
    else
        print($string);
}
?>